app/Http/Controllers/Auth/RegisterController.php

select * from `divisis`
---
    public function showRegistrationForm()
    {
        $divisi = Divisi::all();