app/Http/Controllers/digidocu/DocumentsController.php

  public function index()
  {
    if (auth()->user()->hasRole('Root')) {
      // get all
      $docs = Document::where('isExpire', '!=', 2)->get();
    } else {
      // get user's docs
      // $user_id = auth()->user()->id;

      // $docs = Document::where('user_id',$user_id)->get();

      // get docs in dept
      $dept_id = auth()->user()->department_id;

      $docs = Document::where('isExpire', '!=', 2)->where('department_id', $dept_id)->where('user_id', '!=', auth()->user()->id)->get();
---
select * from `document` where `isExpire` != 2 and `department_id` is null and `user_id` != 6