app/Http/Controllers/digidocu/DocumentsController.php

select * from `divisis` where `id` = '14' limit 1
select * from `divisis` where `id` = '7' limit 1
---
  public function dep_doc(Request $request, $id = null)
  {
    $general = true;
    if ($id == null) {
      $data = Divisi::all()->where('id', '>', 5);
      return view('page.dokumen_spa.documents.index', compact('data', 'general'));
    } else {
      $department = Divisi::where('id', $id)->first();

select * from `document`
---
  public function index(Request $request)
  {
    $docs = Document::all();