app/Http/Controllers/PpicController.php

select * from `events`
---
    public function index()
    {
        $date = Event::toBase()->get();

select * from `produks`
---
    public function bom()
    {
        $list = Produk::all();